export const navigations = {
  logo: { text: "Vasya.inc" },
  left: [
    { hash: "text_blocks", text: "Текстовые блоки" },
    { hash: "gallery", text: "Галерея" },
  ],
  right: [{ hash: "form", text: "Форма с приветами", icon: "👋" }],
};

export const tableData = {
  head: [
    { value: "name", displayValue: "Название", col: 1 },
    { value: "description", displayValue: "Описание", col: 3 },
    { value: "meaning", displayValue: "Значение", col: 1 },
  ],
  body: [
    {
      name: "Пингвин",
      description:
        "Семейство нелетающих морских птиц, единственное современное в отряде пингвинообра́зных. Все представители этого семейства хорошо плавают и ныряют.",
      meaning: "0,3 лошадиных силы",
    },
    {
      name: "Гагарка",
      description:
        "Вид морских птиц из семейства чистиковых. После истребления нелетающей бескрылой гагарки в XIX веке этот вид остался единственным в роде гагарок.",
      meaning: "0,1 лошадиная сила",
    },
    {
      name: "Тупик",
      description:
        "Вид морских птиц из семейства чистиковых отряда ржанкообразных. Обитают на побережьях Атлантического и Северного Ледовитого океанов. Гнездятся в норах на птичьих базарах. Питаются рыбой, в основном песчанками.",
      meaning: "0,1 лошадиная сила",
    },
  ],
};

export const images = [
  { src: "/images/img1.jpg", alt: "img1" },
  { src: "/images/img2.jpg", alt: "img2" },
  { src: "/images/img3.jpg", alt: "img3" },
  { src: "/images/img4.jpg", alt: "img4" },
  { src: "/images/img5.jpg", alt: "img5" },
  { src: "/images/img6.jpg", alt: "img6" },
  { src: "/images/img7.jpg", alt: "img7" },
  { src: "/images/img8.jpg", alt: "img8" },
  { src: "/images/img9.jpg", alt: "img9" },
  { src: "/images/img10.jpg", alt: "img10" },
  { src: "/images/img11.jpg", alt: "img11" },
  { src: "/images/img12.jpg", alt: "img12" },
  { src: "/images/img13.jpg", alt: "img13" },
];
